import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'

const Policy = () => {
  return (
      <ScrollView contentContainerStyle={{flexGrow: 1 }} showsVerticalScrollIndicator={true} > 
      <Text style={styles.title}>תנאי שימוש ומדיניות פרטיות</Text> 
      <Text style={styles.txt}>תנאי השימוש ומדיניות הפרטיות שלהלן (יחד - "התקנון") חלים על כל גולש או משתמש בשירותים הדיגיטליים השונים (להלן "הגולש" או "המשתמש") המוצעים באתר ו/או ביישומון ("אפליקצייה") זה ו/או באמצעותם יחד או לחוד (להלן יחד "האתר"), המתופעלים על-ידי קבוצת DailyHelpMe (להלן "החברה"), מתוקף התקשרותה כדין עם תאגידים ו/או רשויות ו/או נותני שירותים אחרים ככל שיהיו מעת לעת (להלן יחד "התאגידים").</Text> 
      <Text style={styles.txt}>האתר מיועד לאפשר לך לזמן תורים מול התאגידים; לבצע תשלומים ולשלם חשבונות ו/או חובות כלפי התאגידים על-ידי החברה ו/או באמצעות העברת תשלומים לסליקה באמצעות חברה צד ג' (להלן "התשלומים"); ליזום פניות ו/או לשגר טפסים מקוונים אל התאגידים ולקבל מענה או הודעות מהם; לעיין ולצפות במידע אישי, בהסטוריית תשלומים ובנתוני מדידה שונים בקשר לשירותים שאתה צורך ו/או מקבל מהתאגידים; לדווח על מפגעים ותקלות; לשתף תמונות או מיקום או נתוני תקשורת אחרים לפי צורך (להלן יחד - "השירותים") ולעקוב אחר הטיפול באחד או יותר משירותים המפורטים לעיל.</Text> 
      <Text style={styles.txt}>** למען הנוחיות בלבד, תקנון זה מנוסח בלשון זכר אולם הוראותיו מתייחסות בהתאמה כמובן גם לנקבה. עמכן הסליחה.   </Text> 
      <Text style={styles.subTitle}>תחולה והסכמתך לתנאי התקנון</Text>
      <Text style={styles.txt}> 1. השימוש באתר, בתכנים הכלולים בו ובשירותים השונים הזמינים דרכו או מוצעים על-ידו, מעיד על הסכמתך להוראות ולתנאי תקנון זה, לרבות התחייבותך לפעול על-פיו, על כן הנך מתבקש לקרוא את התנאים שלהלן בקפידה.</Text> 
      <Text style={styles.txt}> 2. אם אינן מעוניין לקבל ו/או לאשר את תנאי התקנון שלהלן, כולם או חלקם, עליך להפסיק את השימוש באתר לאלתר. </Text> 
      <Text style={styles.txt}> 3. החברה שומרת לעצמה את הזכות לשנות, למחוק ו/או להוסיף על תנאי תקנון זה בכל עת וללא התחייבות למתן הודעה מוקדמת או בדיעבד. שימושך באתר לאחר ביצוע תוספות ו/או שינויים מעיד על הסכמתך לשינויים אלו, ולכן אנו ממליצים לך לעיין בתנאים אלו מחדש מעת לעת. אם אינך מסכים לשינויים מסוימים, אנא הימנע מהמשך שימוש באתר או פנה אלינו לסיוע כדי לתת לך פתרונות חלופיים. נוסח התקנון המחייב והקובע בכל מועד הינו נוסח התקנון המפורסם באתר. </Text> 
      <Text style={styles.txt}> 4. תנאי תקנון זה אינם באים להחליף תנאים, תנאי שימוש או מדיניות פרטיות של כל אתר או עמוד אחר העשוי להיות מקושר או זמין באמצעות או דרך אתר זה. הגלישה והשימוש בכל אתר אחר כאמור כפופים לתנאיו הפרטניים של אותו אתר, נוסף וללא קשר לתנאי תקנון זה, ומומלץ על כן לעיין בהם בנפרד. </Text> 
      <Text style={styles.txt}> 5. תנאים אלה המפורטים להלן חלים על כל שימוש באתר, לרבות צריכה ו/או ביצוע התשלומים דרכו ו/או באמצעותו ו/או באמצעות סליקת התשלומים על ידי חברה צד ג', צפייה ו/או גישה לתכנים הכלולים בו והשירותים המוצעים בו, בין אם באמצעות מחשב ביתי, מחשב נייד, מכשיר סלולארי, טאבלט ו/או כל מחשב ו/או מכשיר תקשורת אחר, דרכו מתאפשרת הגישה לאתר ו/או לאפליקציה, באמצעות כל תצורה ודרך כל מערכת הפעלה מתאימה. בנוסף, תנאים אלו חלים על השימוש באתר באמצעות כל רשת ו/או אמצעי תקשורת ו/או חיבור אחרים. </Text> 
      <Text style={styles.txt}> 6. החברה תהא רשאית לפעול בדרך של השעיה, חסימה ו/או נקיטת כל פעולה (משפטית או אחרת) כנגד כל משתמש אשר יפר את תנאי השימוש שלהלן. </Text> 
      <Text style={styles.subTitle}>קישורים ותנאים נלווים של צדדים שלישיים </Text> 
      <Text style={styles.txt}> 7. תנאי תקנון זה אינם באים להחליף תנאים, תנאי שימוש או מדיניות פרטיות של כל אתר, ישומון או עמוד אחר העשוי להיות מקושר או זמין דרך אתר זה (להלן "אתרים מקושרים"). אם תבחר לגלוש או להשתמש באתרים חיצוניים, דרך האתר או בעקבות לחיצה על קישור ממנו, אזי שהשימוש בהם יהיה כפוף גם לתנאיהם הפרטניים, נוסף על תנאי מסמך זה, ומומלץ על כן לעיין בהם בנפרד. </Text> 
      <Text style={styles.txt}> 8. קישורים שעשויים להיות מוצגים באתר זה, לאתרים חיצוניים או אחרים, מוצגים לנוחיותך בלבד. כל הסתמכות על אתרים מקושרים או על תוכנם, שימוש בהם או מסירת פרטים דרכם, הינה באחריותך בלבד ובהתאם לתנאי השימוש, תקנון, ומדיניות הפרטיות של אותם אתרים, בנפרד ובאופן בלתי תלוי מתנאי תקנון זה. כמו-כן, החברה שומרת לעצמה את הזכות להסיר מהאתר בכל עת קישורים המופיעים בו, או להימנע מהוספת קישורים חדשים, הכל לפי שיקול דעתה המוחלט. </Text> 
      <Text style={styles.subTitle}> הגבלת אחריות לתוכן האתר וזמינות האתר </Text> 
       <Text style={styles.txt}> 9. החברה עושה מאמצים רבים כדי לספק לך חווית שימוש איכותית ובטוחה באתר. עם זאת, האתר אינו חסין מתקלות ו/או בעיות ועשויה שלא להיות לך גישה לאתר מעת לעת. </Text> 
       <Text style={styles.txt}> 10. האתר, השירותים והתכנים הזמינים ו/או עשויים להיות זמינים דרך האתר, וכל הכלול בו, מונגשים עבורך כפי שהם וללא התחייבות לזמינותם ( 'As Is' ו- 'As Available' ). </Text> 
       <Text style={styles.txt}> 11. החברה אינה ולא תהא אחראית, במישרין או בעקיפין, במפורש או במשתמע, לזמינות, אמיתות, מהימנות ו/או מידת הדיוק של תכני האתר או שירותים הניתנים או מוצעים דרכו, בפרט אם מדובר בתכני צד שלישי ו/או נתונים המוצגים מטעם תאגידים חיצוניים. כל הסתמכות מצידך על תוכן המוצג באתר או דרכו הינה באחריותך המלאה. </Text> 
       <Text style={styles.txt}> 12. החברה אינה אחראית לאי דיוקים ו/או לטעויות שנפלו ביחס לתוכן ו/או ביחס לשירותים המוצעים דרכו או לנתונים המוצגים באמצעותם. החברה מבהירה בזאת שהתוכן הכלול באתר הינו למטרות כלליות ואינפורמטיביות בלבד ולנוחיותך בלבד, ואינו מהווה המלצה ו/או חוות דעת ביחס אליו. כל הסתמכות על הצהרות, הבעות עמדה, עצות או כל תוכן אחר המוצג באתר נעשה לפי שיקול דעתך ובאחריותך הבלעדית. עליך לבצע בעצמך את כל ההערכות והבדיקות לגבי שירות או תשלום או נתון אחר המוצג בהקשר לשירותים, והינך מוותר ותהיה מנוע מלהעלות כנגד החברה כל טענה לגבי הסתמכות כלשהיא עליה. </Text> 
       <Text style={styles.txt}> 13. הנך רשאי להשתמש באתר, בשירותים דרכו ובתוכן הזמין דרכו למטרות פרטיות ואישיות ובלתי מסחריות בלבד. תוכן האתר אינו יכול לשמש בסיס לצורך קבלת החלטות כספיות, משפטיות, אישיות ו/או אחרות מצידך, וכל פעולה הנעשית על-ידך בהתבסס על תוכן באתר היא באחריותך בלבד ולפי שיקול דעתך הבלעדי. </Text> 
       <Text style={styles.txt}> 14. כל תוכן ו/או נתון ו/או מידע המובאים באתר בקשר לשירותים ו/או לתאגידים, אשר מקורם בצדדים שלישיים לחברה, לרבות סכומים, הערכות או הצעות, מדדים, חישובים, תוצאות, מפרטים, הוראות פעולה ונתונים אחרים מטעם או על בסיס נתוני צד שלישי, נמסרים על-ידי הצד השלישי ואינם באחריות החברה בשום אופן. </Text> 
       <Text style={styles.txt}> 15. החברה לא תהא אחראית לאף נזק שנגרם ו/או עלול להיגרם לך ו/או לצד שלישי כלשהוא כתוצאה, במישרין או בעקיפין, מן השימוש באתר, כולל נזק שנגרם בעקבות שימוש ביישומי תוכנה ו/או קבצים ו/או תכנים אשר הורדו ישירות מהאתר ו/או הופעלו דרכו כתוצאה מהשימוש באתר. </Text> 
       <Text style={styles.txt}> 16. למען הסר ספק, שיבוש ו/או תקלה ו/או כשל בקליטת פרטי משתמש באתר או דרכו, לרבות שיבוש ברישום לאתר או לשירות נלווה דרכו ו/או בקליטת תשלום או אמצעי תשלום, לא יהוו עילה לכל טענה ו/או תביעה מצד המשתמש באתר. </Text> 
       <Text style={styles.txt}> 17. החברה רשאית להתיר או להגביל או לאסור את גישת המשתמש לאתר בכל זמן על פי שיקול דעתה הבלעדי ושומרת לעצמה את הזכות הבלעדית לשנות או להפסיק את הפעלת האתר, כולו או חלקו, בכל זמן וללא מתן הודעה, ככל שיידרש בנסיבות המתאימות, ומבלי שתהיה למשתמש כל טענה, זכות ו/או תביעה בקשר לכך. </Text> 
       <Text style={styles.txt}> 18. החברה תהיה רשאית להתנות את הכניסה ו/או השימוש באתר, כולו או חלקו, ברישום ו/או בתשלום, ומבלי שתהיה למשתמש כל טענה, זכות ו/או תביעה בקשר לכך. </Text> 
       <Text style={styles.subTitle}> שימושים אסורים באתר </Text> 
       <Text style={styles.txt}> 19. אינך רשאי לבצע כל פעולה אשר תגרום ו/או תייצר עומס בלתי סביר על האתר, שרתיו ומערכותיו, ו/או כל פעולה העלולה לפגוע באתר, בתפעולו, בתכנים ובאופן הצגתם.</Text> 
       <Text style={styles.txt}> 20. ללא קבלת הרשאה מפורשת, כתובה מראש מהחברה, אינך רשאי לבצע את הפעולות ו/או את המעשים הבאים: </Text> 
       <Text style={[styles.txt,styles.tab]}>(1) שימוש מסחרי באתר ו/או בתוכנו ו/או שימוש בהם לשם יצירת מאגר מידע ו/או לקט;</Text>
       <Text style={[styles.txt,styles.tab]}>(2) להעתיק, לשחזר, לשנות, לעבד, לתרגם, לבצע הנדסה חוזרת, להפיץ, לשדר, להציג, לבצע, לשכפל, לפרסם ולאחסן את תוכן האתר, כולו או חלקו; </Text> 
       <Text style={[styles.txt,styles.tab]}>(3) להפעיל או לאפשר הפעלת כל יישום מחשב או כל אמצעי אחר, לרבות תוכנות מסוג Crawlers, Robots וכדומה, לשם חיפוש, סריקה, העתקה או אחזור אוטומטי של תוכן האתר </Text> 
       <Text style={[styles.txt,styles.tab]}>(4) להציג תוכן מהאתר בתוך מסגרת (iframe ) גלויה או סמויה או להציג את תוכן האתר בכל דרך שהיא, המשנים את עיצובם המקורי באתר ו/או המחסירים דבר כלשהוא; </Text> 
       <Text style={styles.subTitle}>קניין רוחני </Text> 
       <Text style={styles.txt}> 21. אלא אם צוין או סומן אחרת במפורש, החברה הינה הבעלים או מורשית כדין בכל זכויות הקניין הרוחני באתר ובתוכן המצוי בו או נגיש ישירות דרכו, לרבות העיצוב, קוד המקור והקוד הבינארי, סמלים מסחריים, מושגים, סודות מסחריים, סימני מסחר וסימני שירות, זכויות יוצרים, מוניטין, נתוני שוק, זכויות מוסריות, מידע טכני וכל זכות מקבילה או נגזרת לכל אחד מן האמורים לעיל. שימוש בכל אלו, ללא הסכמה מפורשת מראש ובכתב מהחברה הינו אסור ויהווה הפרת זכויותיה של החברה ו/או של צדדים נוספים אחרים על-ידך. </Text> 
       <Text style={styles.txt}> 22. אין להשתמש, להעתיק, לשכפל, לשחזר, לעבד, להפיץ, להציג או לפרסם כל תוכן מהאתר או לעשות בו כל שימוש לצרכים מסחריים או פרטיים, על-ידך או על-ידי אחר מטעמך, ללא הסכמה מפורשת מראש ובכתב מהחברה. </Text> 
       <Text style={styles.subTitle}>יצירת קשר</Text> 
       <Text style={styles.txt}> 23. על-פי חוק הגנת הפרטיות, התשמ"א-1981, הינך, או מי מטעמך, רשאי לעיין במידע אודותיך אשר מצוי במאגרי החברה, ככל שמידע אודותיך מוחזק בידה, ואף לבקש מאיתנו לתקן מידע זה אם אינו נכון, שלם או מדויק. כדי לממש זכות זו, יש לשלוח בקשה בכתב אל החברה לכתובת המייל: rupb862022@gmail.com. בכל תכתובת לחברה יש לכלול את פרטיך המלאים לרבות, כתובת, e-mail , ומספר טלפון ליצירת קשר. החברה תשתדל להגיב לכל בקשה סבירה בזמן סביר. </Text> 
    </ScrollView>
  )
}


export default Policy

const styles = StyleSheet.create({
  title:{
    fontSize:14, 
    fontWeight: 'bold',
    alignSelf: 'center',
  },
  subTitle:{
    fontSize:10, 
    fontWeight: 'bold',
  },
  txt:{
    fontSize: 10,
  },
  tab:{
    marginLeft:10
  }
})